# Lecture 5
## Missing Data

In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'A':[1, 2, np.nan], 'B':[1, np.nan, np.nan], 'C':[1, 2, 3]}

In [4]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
# Can use the dropna method to get rid of nan values
df.dropna()

     A    B  C
0  1.0  1.0  1

In [9]:
# Can also do this along the column
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [13]:
# Can also set a threshold for the number of non-nan values that mean it will be kept
df.dropna(thresh=2)

     A    B  C
0  1.0  1.0  1
1  2.0  NaN  2

In [15]:
# Can also fill the nan with something else using fillna
df.fillna(100)

       A      B  C
0    1.0    1.0  1
1    2.0  100.0  2
2  100.0  100.0  3

In [18]:
# Could also add a calculation; 
# REMEMBER, this doesn't replace the values, need inplace = true for this
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Lecture 6
## Groupby Functions
Groupby allows to group by rows and perform an aggregate function on them

In [19]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [21]:
df = pd.DataFrame(data)

In [23]:
# Using groupby will create a groupby object
byComp = df.groupby('Company')
byComp

In [25]:
# Now there are many methods that can be used on this
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [26]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [27]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [28]:
# Notice that this will also return a Person column, this is NOT the associated value
# This is because Python will sort them in alphabetical order and give the max
# As the closest to the end of the alphabet
byComp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [30]:
# Can also use describe to get lots of inf
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Lecture 7
## Merging, Joining, Concatenating
These lectures are done through the workbook, refer to them

#Concatenating is done using the concat method
pd.concat()

#Merging uses a shared key column to join two DataFrames
# This can use SQL left, right, outer, inner syntax
pd.merge(, , on='keys')

# Join can be used to join two DataFrames on the index
# This can use SQL left, right, outer, inner syntax
left = pd.DataFrame
right = pd.DataFrame

left.join(right)

# Lecture 8
## Operations

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df['col2'].unique()

array([444, 555, 666])

In [6]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [10]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64